[Killed] ObjectLiteral
models/book.js:11:13
     static associate(models) {
     }
   };
-  Book.init({
-    title: {
-      type: DataTypes.STRING,
-      allowNull: false,
-      validate: {
-        notEmpty: {
-          msg: "Please Provide a Value For Title",
-        },
-      }
-    },
-    author: {
-      type: DataTypes.STRING,
-      allowNull: false,
-      validate: {
-        notEmpty: {
-          msg: "Please Provide a Value For Author",
-        },
-      }
-    },
-    genre: DataTypes.STRING,
-    year: DataTypes.INTEGER
-  }, {
+  Book.init({}, {
     sequelize,
     modelName: 'Book',
killedBy: Routes the "/books" route must return the existing books
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Test Book"

[Killed] ObjectLiteral
models/book.js:15:17
     title: {
       type: DataTypes.STRING,
       allowNull: false,
-      validate: {
-        notEmpty: {
-          msg: "Please Provide a Value For Title",
-        },
-      }
+      validate: {}
     },
     author: {
killedBy: Routes when creating a new book with post request in "/books/new" must return relevant error messages if a error returned
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Please Provide a Value For Title"

[Killed] ObjectLiteral
models/book.js:16:19
       type: DataTypes.STRING,
       allowNull: false,
       validate: {
-        notEmpty: {
-          msg: "Please Provide a Value For Title",
-        },
+        notEmpty: {},
       }
     },
killedBy: Routes when creating a new book with post request in "/books/new" must return relevant error messages if a error returned
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Please Provide a Value For Title"

[Killed] StringLiteral
models/book.js:17:16
       allowNull: false,
       validate: {
         notEmpty: {
-          msg: "Please Provide a Value For Title",
+          msg: "",
         },
       }
killedBy: Routes when creating a new book with post request in "/books/new" must return relevant error messages if a error returned
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Please Provide a Value For Title"

[Killed] ObjectLiteral
models/book.js:24:17
     author: {
       type: DataTypes.STRING,
       allowNull: false,
-      validate: {
-        notEmpty: {
-          msg: "Please Provide a Value For Author",
-        },
-      }
+      validate: {}
     },
     genre: DataTypes.STRING,
killedBy: Routes when creating a new book with post request in "/books/new" must return relevant error messages if a error returned
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Please Provide a Value For Author"

[Killed] ObjectLiteral
models/book.js:25:19
       type: DataTypes.STRING,
       allowNull: false,
       validate: {
-        notEmpty: {
-          msg: "Please Provide a Value For Author",
-        },
+        notEmpty: {},
       }
     },
killedBy: Routes when creating a new book with post request in "/books/new" must return relevant error messages if a error returned
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Please Provide a Value For Author"

[Killed] StringLiteral
models/book.js:26:16
       allowNull: false,
       validate: {
         notEmpty: {
-          msg: "Please Provide a Value For Author",
+          msg: "",
         },
       }
killedBy: Routes when creating a new book with post request in "/books/new" must return relevant error messages if a error returned
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Please Provide a Value For Author"

[Survived] StringLiteral
models/book.js:34:16
     year: DataTypes.INTEGER
   }, {
     sequelize,
-    modelName: 'Book',
+    modelName: "",
   });
   return Book;
