[Timeout] BlockStatement
routes/index.js:12:35
 
 // Handler Function for Async Functions
 function asyncHandler(callback){
-  return async(req, res, next) => {
-    try {
-      await callback(req, res, next)
-    } catch(error){
-      // Forward error to the global error handler
-      next(error);
-    }
-  }
+  return async(req, res, next) => {}
 }
 

[Timeout] BlockStatement
routes/index.js:13:9
 // Handler Function for Async Functions
 function asyncHandler(callback){
   return async(req, res, next) => {
-    try {
-      await callback(req, res, next)
-    } catch(error){
+    try {} catch(error){
       // Forward error to the global error handler
       next(error);

[Timeout] BlockStatement
routes/index.js:15:19
   return async(req, res, next) => {
     try {
       await callback(req, res, next)
-    } catch(error){
-      // Forward error to the global error handler
-      next(error);
-    }
+    } catch(error){}
   }
 }

[Killed] BlockStatement
routes/index.js:23:56
 }
 
 /* GET home page. */
-router.get('/', asyncHandler(async (req, res, next) => {
-  res.redirect('/books');
-}));
+router.get('/', asyncHandler(async (req, res, next) => {}));
 
 /* GET books page with search results */
killedBy: Routes When a User enter the site from "/" system must route to "/books"
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] ConditionalExpression
routes/index.js:32:16
   const search = req.query.search;
   let books;
   let bookCount;
-  const page = req.query.page || 1;
+  const page = true;
 
   if(search) {
killedBy: Routes when the user makes a GET request to "/books" with a page number it must return the limited results
statusReason: Error: expect(received).not.toBe(expected) // Object.is equality

[Killed] LogicalOperator
routes/index.js:32:16
   const search = req.query.search;
   let books;
   let bookCount;
-  const page = req.query.page || 1;
+  const page = req.query.page && 1;
 
   if(search) {
killedBy: Routes the "/books" route must return the existing books
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Test Book"
Received string:    "<!DOCTYPE html><html><head><link rel=\"stylesheet\" href=\"/stylesheets/style.css\"></head><body><h1></h1><h2>A Server Error Occured! SQLITE_ERROR: no such column: NaN</h2><pre>SequelizeDatabaseError: A Server Error Occured! SQLITE_ERROR: no such column: NaN

[Killed] ConditionalExpression
routes/index.js:34:6
   let bookCount;
   const page = req.query.page || 1;
 
-  if(search) {
+  if(false) {
     books = await Book.findAndCountAll({  
       where: {
killedBy: Routes search by author must return books matching the author field
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "AuthorSearchBook"

[Killed] ObjectLiteral
routes/index.js:44:21
             }
           },
             {
-            author: {
-              [Op.like]: `%${search}%`
-            }
+            author: {}
           },
             {
killedBy: Routes when the user sends a GET request to "/books" with a search query it must return the title-filtered results
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "UniqueTitle999"
Received string:    "<!DOCTYPE html><html><head><link rel=\"stylesheet\" href=\"/stylesheets/style.css\"></head><body><h1></h1><h2>A Server Error Occured! Invalid value {}</h2><pre>Error: A Server Error Occured! Invalid value {}

[Killed] ObjectLiteral
routes/index.js:48:13
               [Op.like]: `%${search}%`
             }
           },
-            {
-            genre: {
-              [Op.like]: `%${search}%`
-            }
-          },
+            {},
             {
             year: {
killedBy: Routes search by genre must return books matching the genre field
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "GenreSearchBook"

[Killed] ObjectLiteral
routes/index.js:53:13
               [Op.like]: `%${search}%`
             }
           },
-            {
-            year: {
-              [Op.like]: `%${search}%`
-            }
-          } 
+            {} 
         ]
       },
killedBy: Routes search by year must return books matching the year field
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "YearSearchBook"

[Killed] ArithmeticOperator
routes/index.js:61:15
         ]
       },
       limit: 5,
-      offset: page * 5 - 5,
+      offset: page / 5 - 5,
       page,
     })
killedBy: Routes when the user sends a GET request to "/books" with a search query it must return the title-filtered results
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "UniqueTitle999"
Received string:    "<!DOCTYPE html><html><head><link rel=\"stylesheet\" href=\"/stylesheets/style.css\"></head><body><h1></h1><h2>A Server Error Occured! SQLITE_MISMATCH: datatype mismatch</h2><pre>SequelizeDatabaseError: A Server Error Occured! SQLITE_MISMATCH: datatype mismatch

[Killed] ArithmeticOperator
routes/index.js:61:15
         ]
       },
       limit: 5,
-      offset: page * 5 - 5,
+      offset: page * 5 + 5,
       page,
     })
killedBy: Routes when the user sends a GET request to "/books" with a search query it must return the title-filtered results
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "UniqueTitle999"

[Survived] ArithmeticOperator
routes/index.js:65:27
       page,
     })
     bookCount = books.count;
-    pageCount = Math.ceil(bookCount / 5);
+    pageCount = Math.ceil(bookCount * 5);
   } else {
     books = await Book.findAndCountAll({

[Killed] BlockStatement
routes/index.js:66:10
     })
     bookCount = books.count;
     pageCount = Math.ceil(bookCount / 5);
-  } else {
-    books = await Book.findAndCountAll({
-      limit: 5,
-      offset: page*5 -5,
-    });
-  }
+  } else {}
   bookCount = books.count;
   pageCount = Math.ceil(bookCount / 5);
killedBy: Routes the "/books" route must return the existing books
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Test Book"

[Killed] ObjectLiteral
routes/index.js:67:40
     bookCount = books.count;
     pageCount = Math.ceil(bookCount / 5);
   } else {
-    books = await Book.findAndCountAll({
-      limit: 5,
-      offset: page*5 -5,
-    });
+    books = await Book.findAndCountAll({});
   }
   bookCount = books.count;
killedBy: Routes page 1 must not show books that belong to page 2
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 0
Received length: 10
Received array:  ["PagedBook 01", "PagedBook 02", "PagedBook 03", "PagedBook 04", "PagedBook 05", "PagedBook 06", "PagedBook 07", "PagedBook 08", "PagedBook 09", "PagedBook 10"]

[Survived] StringLiteral
routes/index.js:81:14
   // console.log(pageCount);
   // console.log(page);
 
-  res.render('index', { 
+  res.render("", { 
     books: books.rows,
     pageCount,

[Killed] BlockStatement
routes/index.js:91:40
 }));
 
 /* GET new-book page, shows the create new book form*/
-router.get('/books/new', (req, res) => {
-  res.render('new-book', {book: {}, title: "New Book"});
-});
+router.get('/books/new', (req, res) => {});
 
 /* POST New Book, posts a new book to the database*/
killedBy: Routes the "/books/new" route must route the user to a new book adding panel
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] StringLiteral
routes/index.js:91:12
 }));
 
 /* GET new-book page, shows the create new book form*/
-router.get('/books/new', (req, res) => {
+router.get("", (req, res) => {
   res.render('new-book', {book: {}, title: "New Book"});
 });
killedBy: Routes the "/books/new" route must route the user to a new book adding panel
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "New Book"
Received string:    "<!DOCTYPE html><html><head><link rel=\"stylesheet\" href=\"/stylesheets/style.css\"></head><body><h1></h1><h2>A Server Error Occured! Cannot read properties of null (reading 'title')</h2><pre>TypeError: A Server Error Occured! Cannot read properties of null (reading 'title')

[Survived] StringLiteral
routes/index.js:92:44
 
 /* GET new-book page, shows the create new book form*/
 router.get('/books/new', (req, res) => {
-  res.render('new-book', {book: {}, title: "New Book"});
+  res.render('new-book', {book: {}, title: ""});
 });
 

[Timeout] BlockStatement
routes/index.js:96:59
 });
 
 /* POST New Book, posts a new book to the database*/
-router.post('/books/new', asyncHandler(async(req, res) => {
-  let book;
-  try{
-    book = await Book.create(req.body);
-    res.redirect("/books");
-  } catch (error) {
-    if(error.name === 'SequelizeValidationError') {
-      const errors = error.errors.map(err => err.message)
-      res.render('new-book', {errors, book, title: "New Book"});
-    } else {
-      throw error;
-    }
-  }
-}));
+router.post('/books/new', asyncHandler(async(req, res) => {}));
 
 /* GET books/:id page, renders book deatil form*/

[Timeout] BlockStatement
routes/index.js:98:6
 /* POST New Book, posts a new book to the database*/
 router.post('/books/new', asyncHandler(async(req, res) => {
   let book;
-  try{
-    book = await Book.create(req.body);
-    res.redirect("/books");
-  } catch (error) {
+  try{} catch (error) {
     if(error.name === 'SequelizeValidationError') {
       const errors = error.errors.map(err => err.message)

[Killed] StringLiteral
routes/index.js:100:18
   let book;
   try{
     book = await Book.create(req.body);
-    res.redirect("/books");
+    res.redirect("");
   } catch (error) {
     if(error.name === 'SequelizeValidationError') {
killedBy: Routes a post request to "/books/new" should create a book and redirect
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/books"
Received: ""

[Timeout] BlockStatement
routes/index.js:101:19
   try{
     book = await Book.create(req.body);
     res.redirect("/books");
-  } catch (error) {
-    if(error.name === 'SequelizeValidationError') {
-      const errors = error.errors.map(err => err.message)
-      res.render('new-book', {errors, book, title: "New Book"});
-    } else {
-      throw error;
-    }
-  }
+  } catch (error) {}
 }));
 

[Killed] BlockStatement
routes/index.js:102:51
     book = await Book.create(req.body);
     res.redirect("/books");
   } catch (error) {
-    if(error.name === 'SequelizeValidationError') {
-      const errors = error.errors.map(err => err.message)
-      res.render('new-book', {errors, book, title: "New Book"});
-    } else {
+    if(error.name === 'SequelizeValidationError') {} else {
       throw error;
     }
killedBy: Routes when creating a new book with post request in "/books/new" must return relevant error messages if a error returned
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Survived] ConditionalExpression
routes/index.js:102:8
     book = await Book.create(req.body);
     res.redirect("/books");
   } catch (error) {
-    if(error.name === 'SequelizeValidationError') {
+    if(true) {
       const errors = error.errors.map(err => err.message)
       res.render('new-book', {errors, book, title: "New Book"});

[Killed] ArrowFunction
routes/index.js:103:39
     res.redirect("/books");
   } catch (error) {
     if(error.name === 'SequelizeValidationError') {
-      const errors = error.errors.map(err => err.message)
+      const errors = error.errors.map(() => undefined)
       res.render('new-book', {errors, book, title: "New Book"});
     } else {
killedBy: Routes when creating a new book with post request in "/books/new" must return relevant error messages if a error returned
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Please Provide a Value For Title"

[Survived] StringLiteral
routes/index.js:104:52
   } catch (error) {
     if(error.name === 'SequelizeValidationError') {
       const errors = error.errors.map(err => err.message)
-      res.render('new-book', {errors, book, title: "New Book"});
+      res.render('new-book', {errors, book, title: ""});
     } else {
       throw error;

[Killed] BlockStatement
routes/index.js:105:12
     if(error.name === 'SequelizeValidationError') {
       const errors = error.errors.map(err => err.message)
       res.render('new-book', {errors, book, title: "New Book"});
-    } else {
-      throw error;
-    }
+    } else {}
   }
 }));
killedBy: Routes POST "/books/new" must render server error page when an unexpected error occurs
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] BlockStatement
routes/index.js:112:58
 }));
 
 /* GET books/:id page, renders book deatil form*/
-router.get('/books/:id', asyncHandler(async(req, res) => {
-  const book = await Book.findByPk(req.params.id);
-  res.render('update-book', {book, title: book.title});
-}));
+router.get('/books/:id', asyncHandler(async(req, res) => {}));
 
 /* POST /books/:id, updates book info in the database*/
killedBy: Routes "/books/:id" route with a valid id must route the user to a update book panel
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] StringLiteral
routes/index.js:112:12
 }));
 
 /* GET books/:id page, renders book deatil form*/
-router.get('/books/:id', asyncHandler(async(req, res) => {
+router.get("", asyncHandler(async(req, res) => {
   const book = await Book.findByPk(req.params.id);
   res.render('update-book', {book, title: book.title});
killedBy: Routes "/books/:id" route with a valid id must route the user to a update book panel
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Update Test"
Received string:    "<!DOCTYPE html><html><head><link rel=\"stylesheet\" href=\"/stylesheets/style.css\"></head><body><h1>404 Error!  Page Not Found!  </h1><p>A 404 Error Occured!  The webpage could not be found!</p><br><br><a class=\"button\" href=\"/\">Back to the \"Books\" Page</a></body></html>"

[Killed] StringLiteral
routes/index.js:114:14
 /* GET books/:id page, renders book deatil form*/
 router.get('/books/:id', asyncHandler(async(req, res) => {
   const book = await Book.findByPk(req.params.id);
-  res.render('update-book', {book, title: book.title});
+  res.render("", {book, title: book.title});
 }));
 
killedBy: Routes "/books/:id" route with a valid id must route the user to a update book panel
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Update Test"
Received string:    "<!DOCTYPE html><html><head><link rel=\"stylesheet\" href=\"/stylesheets/style.css\"></head><body><h1></h1><h2>A Server Error Occured! C:\\Users\\Utku\\Documents\\GithubProjects\\SE2226-Software-Testing\\Library-DB-Express\\.stryker-tmp\\sandbox-jz1xiz\\views\\index.pug:14
    12|     br·

[Timeout] BlockStatement
routes/index.js:118:59
 }));
 
 /* POST /books/:id, updates book info in the database*/
-router.post('/books/:id', asyncHandler(async(req, res) => {
-  const book = await Book.findByPk(req.params.id);
-  try{
-    await book.update(req.body);
-    res.redirect('/books');
-  } catch (error) {
-    if(error.name === 'SequelizeValidationError') {
-      const errors = error.errors.map(err => err.message);
-      res.render('update-book', {errors, book, title: book.title});
-    } else {
-      throw error;
-    }
-  }
-}));
+router.post('/books/:id', asyncHandler(async(req, res) => {}));
 
 /* POST /books/:id/delete, deletes a book*/

[Killed] StringLiteral
routes/index.js:118:13
 }));
 
 /* POST /books/:id, updates book info in the database*/
-router.post('/books/:id', asyncHandler(async(req, res) => {
+router.post("", asyncHandler(async(req, res) => {
   const book = await Book.findByPk(req.params.id);
   try{
killedBy: Routes a post request to "/books/:id" must update a book and return 302 status code
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 302
Received: 200

[Timeout] BlockStatement
routes/index.js:120:6
 /* POST /books/:id, updates book info in the database*/
 router.post('/books/:id', asyncHandler(async(req, res) => {
   const book = await Book.findByPk(req.params.id);
-  try{
-    await book.update(req.body);
-    res.redirect('/books');
-  } catch (error) {
+  try{} catch (error) {
     if(error.name === 'SequelizeValidationError') {
       const errors = error.errors.map(err => err.message);

[Timeout] BlockStatement
routes/index.js:123:19
   try{
     await book.update(req.body);
     res.redirect('/books');
-  } catch (error) {
-    if(error.name === 'SequelizeValidationError') {
-      const errors = error.errors.map(err => err.message);
-      res.render('update-book', {errors, book, title: book.title});
-    } else {
-      throw error;
-    }
-  }
+  } catch (error) {}
 }));
 

[Killed] BlockStatement
routes/index.js:124:51
     await book.update(req.body);
     res.redirect('/books');
   } catch (error) {
-    if(error.name === 'SequelizeValidationError') {
-      const errors = error.errors.map(err => err.message);
-      res.render('update-book', {errors, book, title: book.title});
-    } else {
+    if(error.name === 'SequelizeValidationError') {} else {
       throw error;
     }
killedBy: Routes when updating a book with post request in "/books/:id" must return relevant error messages if a error returned
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Survived] EqualityOperator
routes/index.js:124:8
     await book.update(req.body);
     res.redirect('/books');
   } catch (error) {
-    if(error.name === 'SequelizeValidationError') {
+    if(error.name !== 'SequelizeValidationError') {
       const errors = error.errors.map(err => err.message);
       res.render('update-book', {errors, book, title: book.title});

[Killed] ArrowFunction
routes/index.js:125:39
     res.redirect('/books');
   } catch (error) {
     if(error.name === 'SequelizeValidationError') {
-      const errors = error.errors.map(err => err.message);
+      const errors = error.errors.map(() => undefined);
       res.render('update-book', {errors, book, title: book.title});
     } else {
killedBy: Routes when updating a book with post request in "/books/:id" must return relevant error messages if a error returned
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Please Provide a Value For Title"

[Killed] ObjectLiteral
routes/index.js:126:33
   } catch (error) {
     if(error.name === 'SequelizeValidationError') {
       const errors = error.errors.map(err => err.message);
-      res.render('update-book', {errors, book, title: book.title});
+      res.render('update-book', {});
     } else {
       throw error;
killedBy: Routes when updating a book with post request in "/books/:id" must return relevant error messages if a error returned
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "Please Provide a Value For Title"
Received string:    "<!DOCTYPE html><html><head><link rel=\"stylesheet\" href=\"/stylesheets/style.css\"></head><body><h1></h1><h2>A Server Error Occured! C:\\Users\\Utku\\Documents\\GithubProjects\\SE2226-Software-Testing\\Library-DB-Express\\.stryker-tmp\\sandbox-jz1xiz\\views\\update-b

[Killed] BlockStatement
routes/index.js:127:12
     if(error.name === 'SequelizeValidationError') {
       const errors = error.errors.map(err => err.message);
       res.render('update-book', {errors, book, title: book.title});
-    } else {
-      throw error;
-    }
+    } else {}
   }
 }));
killedBy: Routes POST "/books/:id" must render server error page when an unexpected error occurs
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] BlockStatement
routes/index.js:134:66
 }));
 
 /* POST /books/:id/delete, deletes a book*/
-router.post('/books/:id/delete', asyncHandler(async(req, res) => {
-  const book = await Book.findByPk(req.params.id);
-  await book.destroy();
-  res.redirect('/books');
-}))
+router.post('/books/:id/delete', asyncHandler(async(req, res) => {}))
 
 module.exports = router;
killedBy: Routes when the user makes a POST request to "/books/:id/delete" must delete the book with the corresponding id
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."
